OpenPuya/PY32F072_Firmware/Drivers/PY32F072_HAL_Driver/Inc/py32f072_ll_flash.h
  /* Exit critical section: restore previous priority mask */
  __set_PRIMASK(primask_bit);
}

/**
  * @}
  */

/** @defgroup FLASH_LL_EF_OPTR_Management OPTR Management
  * @{
  */

/**
  * @brief  Get nBOOT1 Mode
  * @rmtoll OPTR       nBOOT1           LL_FLASH_GetnBOOT1Mode
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_NBOOT1_CLR
  *         @arg @ref LL_FLASH_NBOOT1_SET
  */
__STATIC_INLINE uint32_t LL_FLASH_GetnBOOT1Mode(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR, FLASH_OPTR_nBOOT1);
}

/**
  * @brief  Get NRST Mode
  * @rmtoll OPTR        NRST_MODE       LL_FLASH_GetNrstMode
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_NRST_MODE_RESET
  *         @arg @ref LL_FLASH_NRST_MODE_GPIO
  */
__STATIC_INLINE uint32_t LL_FLASH_GetNrstMode(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR, FLASH_OPTR_NRST_MODE);
}

/**
  * @brief  Get IWDG In Stop Mode
  * @rmtoll OPTR        IWDG_STOP       LL_FLASH_GetIWDGInStop
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_IWDG_INSTOP_FREEZE
  *         @arg @ref LL_FLASH_IWDG_INSTOP_ACTIVE
  */
__STATIC_INLINE uint32_t LL_FLASH_GetIWDGInStop(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR, FLASH_OPTR_IWDG_STOP);
}

/**
  * @brief  Get WWDG SW Mode
  * @rmtoll OPTR        WWDG_SW       LL_FLASH_GetWWDGSWMode
  * @param  FLASHx FLASH Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_GetWWDGSWMode(FLASH_TypeDef *FLASHx)
{
  return (READ_BIT(FLASHx->OPTR, FLASH_OPTR_WWDG_SW) == (FLASH_OPTR_WWDG_SW));
}

/**
  * @brief  Get IWDG SW Mode
  * @rmtoll OPTR        IWDG_SW          LL_FLASH_GetIWDGSWMode
  * @param  FLASHx FLASH Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_GetIWDGSWMode(FLASH_TypeDef *FLASHx)
{
  return (READ_BIT(FLASHx->OPTR, FLASH_OPTR_IWDG_SW) != (FLASH_OPTR_IWDG_SW));
}

/**
  * @}
  */

/** @defgroup FLASH_LL_EF_SDK_Management SDK Management
  * @{
  */

/**
  * @brief  Set SDK Address
  * @rmtoll SDKR        SDK_STRT        LL_FLASH_SetSDKAddress
  * @rmtoll SDKR        SDK_END         LL_FLASH_SetSDKAddress
  * @rmtoll SDKR        BOR_LEVEL       LL_FLASH_SetSDKAddress
  * @rmtoll SDKR        BOR_EN          LL_FLASH_SetSDKAddress
  * @param  FLASHx FLASH Instance
  * @param  SDKStartAddress This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08000000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08000800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08001000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08001800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08002000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08002800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08003000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08003800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08004000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08004800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08005000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08005800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08006000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08006800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08007000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08007800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08008000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08008800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08009000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08009800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800A000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800A800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800B000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800B800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800C000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800C800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800D000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800D800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800E000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800E800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800F000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800F800
  * @param  SDKEndAddress This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080007FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08000FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080017FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08001FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080027FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08002FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080037FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08003FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080047FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08004FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080057FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08005FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080067FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08006FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080077FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08007FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080087FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08008FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080097FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08009FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800A7FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800AFFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800B7FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800BFFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800C7FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800CFFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800D7FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800DFFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800E7FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800EFFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800F7FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800FFFF
  * @param  BOREnable This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BOR_ENABLE
  *         @arg @ref LL_FLASH_BOR_DISABLE
  * @param  BORLevel This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_BOR_LEV0
  *         @arg @ref LL_FLASH_BOR_LEV1
  *         @arg @ref LL_FLASH_BOR_LEV2
  *         @arg @ref LL_FLASH_BOR_LEV3
  *         @arg @ref LL_FLASH_BOR_LEV4
  *         @arg @ref LL_FLASH_BOR_LEV5
  *         @arg @ref LL_FLASH_BOR_LEV6
  *         @arg @ref LL_FLASH_BOR_LEV7
  * @retval None.
  */
__STATIC_INLINE void LL_FLASH_SetSDKAddress(FLASH_TypeDef *FLASHx,uint32_t SDKStartAddress,uint32_t SDKEndAddress, \
                                                                  uint32_t BOREnable,      uint32_t BORLevel)
{
  MODIFY_REG(FLASHx->SDKR, (FLASH_SDKR_SDK_STRT | FLASH_SDKR_SDK_END | FLASH_SDKR_BOR_LEV | FLASH_SDKR_BOR_EN) , \
                           (SDKStartAddress | SDKEndAddress | BOREnable | BORLevel));
}

/**
  * @brief  Get SDK Start Address
  * @rmtoll SDKR        SDK_STRT        LL_FLASH_GetSDKStartAddress
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be a one of the following values:
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08000000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08000800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08001000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08001800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08002000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08002800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08003000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08003800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08004000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08004800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08005000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08005800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08006000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08006800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08007000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08007800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08008000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08008800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08009000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X08009800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800A000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800A800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800B000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800B800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800C000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800C800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800D000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800D800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800E000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800E800
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800F000
  *         @arg @ref LL_FLASH_SDKSTARTADDRESS_0X0800F800
  * @retval None
  */
__STATIC_INLINE uint32_t LL_FLASH_GetSDKStartAddress(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->SDKR, FLASH_SDKR_SDK_STRT);
}

/**
  * @brief  Get SDK End Address
  * @rmtoll SDKR        SDK_END         LL_FLASH_GetSDKEndAddress
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be a one of the following values:
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080007FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08000FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080017FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08001FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080027FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08002FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080037FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08003FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080047FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08004FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080057FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08005FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080067FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08006FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080077FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08007FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080087FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08008FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X080097FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X08009FFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800A7FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800AFFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800B7FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800BFFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800C7FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800CFFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800D7FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800DFFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800E7FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800EFFF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800F7FF
  *         @arg @ref LL_FLASH_SDKENDADDRESS_0X0800FFFF
  * @retval None
  */
__STATIC_INLINE uint32_t LL_FLASH_GetSDKEndAddress(FLASH_TypeDef *FLASHx)
{
  return (READ_BIT(FLASHx->SDKR, FLASH_SDKR_SDK_END));
}

/**
  * @brief  Check if BOR is enabled
  * @rmtoll SDKR        BOR_EN          LL_FLASH_IsEnabledBOR
  * @param  FLASHx FLASH Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsEnabledBOR(FLASH_TypeDef *FLASHx)
{
  return (READ_BIT(FLASHx->SDKR, FLASH_SDKR_BOR_EN) == (FLASH_SDKR_BOR_EN));
}

/**
  * @brief  Get the BOR Level
  * @rmtoll SDKR        BOR_LEV         LL_FLASH_GetBORLevel
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_BOR_LEV0
  *         @arg @ref LL_FLASH_BOR_LEV1
  *         @arg @ref LL_FLASH_BOR_LEV2
  *         @arg @ref LL_FLASH_BOR_LEV3
  *         @arg @ref LL_FLASH_BOR_LEV4
  *         @arg @ref LL_FLASH_BOR_LEV5
  *         @arg @ref LL_FLASH_BOR_LEV6
  *         @arg @ref LL_FLASH_BOR_LEV7
  */
__STATIC_INLINE uint32_t LL_FLASH_GetBORLevel(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->SDKR, FLASH_SDKR_BOR_LEV);
}

/**
  * @}
  */

